channels = (
    (#0
        'Технология разработки программного обеспечения 2 подгруппа',
        1,
        # дата последнего обновления определена при заполнении
        'Ольга Кизер',
    ),
    (#1
        'Инструментальное программное обеспечение',
        1,
        'Ольга Кизер',
    ),
    (#2
        'Основы алгоритмизации и программирования',
        0,
        'Татьяна Шатова',
    ),
    (#3
        'Тестирование программного обеспечения',
        0,
        'Вероника Хомич',
    ),
    (#4
        'Математическое моделирвоание',
        0,
        'Анжелика Кривичанина',
    ),
    (#5
        'Конструирование программного обеспечения и языки программирования',
        0,
        'Павел Равданович',
    ),
    (#6
        'Защита компьютерной информации',
        0,
        'Анжелика Кривичанина',
    ),
    (#7
        'Алгебро-логические основы вычислительной техники',
        0,
        'Елена Брынина'
    ),
)
